{
  "blogs": [
    {
      "title": "Let’s Start Here",
      "review": "For rap fans, the biggest shock of the year so far came when Lil Yachty dropped his new album Let’s Start Here back in January. Without announcing any intent to switch genres, Yachty shifted his style drastically. The album is a Funkadelic-inspired embrace of classic psychedelic rock and soul music. While many rappers from Logic to Vic Mensa to Kid Cudi have tried to crossover into the world of rock music, none do it as well as Yachty.",
      "artist": "Lil Yachty ",
      "id": 1
    },
    {
      "title": "A Gift & A Curse",
      "review": "Throughout the project, Gunna gives us a ton of insight into where he is mentally. On tracks like “Back To The Moon,” “Back At It” and “I Was Just Thinking,” Gunna takes direct shots at those who have put dirt on his name. Additionally, he gave us one of the best songs of the year with the incredibly catchy “fukumean.” The Atlanta rapper’s hunger throughout the album makes this one of the best listens of the year so far. Naturally, people are going to compare this project to Young Thug’s and Lil Durk’s. These comparisons are valid. However, the context behind this project is a bit different and you have to appreciate Wunna’s ability to overcome adversity.",
      "artist": "Gunna",
      "id": 2
    },
    {
      "title": "Business Is Business",
      "review": "The album’s very essence, comprising tracks that Thug safeguarded over the years, serves as a testament to his timeless approach to crafting hits. “Jonesboro” flawlessly marries Metro’s eerie production with Thug’s haunting recollections of Cleveland Ave. And let’s not forget the infectious earworms like “Oh U Went” featuring Drake and “Hellcat Kenny” featuring Lil Uzi Vert, destined to dominate summer playlists.",
      "artist": "Young Thug",
      "id": 3
    },
    {
      "title": "Almost Healed",
      "review": "Few trap albums this year are as self-aware and hard-hitting as the Chicago MC’s latest offering. Lil Durk’s Almost Healed sees Smruk balance a thin line, loyalty to the streets and acknowledgement of its cyclical pain, with blunt but heart-wrenching detail and skill. “I send money to jails, I send money for funerals, even though they goin’ to hell for all them n***as they killed,” he raps on the track “Pelle Coat.” “You know I’m part of my brother ‘nem forever ever, ever, I’m goin’ to hell.” For every threat to his opposition or bar about his wealth or hedonism, he recognizes his personal flaws and aims to fix them.",
      "artist": "Lil Durk",
      "id": 4
    }
  ]
}